1/code/param/2/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpesaFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
sample
{
    type sets;
    libs ("libsampling.so");
    writeControl timeStep;
    outputInterval 1;

    interpolationScheme cellPoint;
    setFormat raw;
    <setsFromSample--AutoReplace>
    fields ( p U);
}
// ************************************************************************* //